<details><summary>Digger run report at 2024-02-13 15:16:35 (UTC)</summary>
  <details><summary>Apply for <b>idolactivities/tf-playground#common-main</b></summary>
  
```terraform
Terraform will perform the following actions:

  # random_id.example will be created
  + resource "random_id" "example" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # tls_private_key.example will be created
  + resource "tls_private_key" "example" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ssh_private_key = (sensitive value)
random_id.example: Creating...
tls_private_key.example: Creating...
random_id.example: Creation complete after 0s [id=3wu_jQ]
tls_private_key.example: Creation complete after 0s [id=f4ecedae6e626220bbf1c43df459243d2ad7f103]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

hello_world = "hello world"
ssh_private_key = <sensitive>

  ```
</details>
</details>